In [2]:
import os
os.listdir()

['.ipynb_checkpoints',
 'test01.csv',
 'test01.ipynb',
 'test01.txt',
 'test01.xlsx']

In [4]:
import pandas

In [13]:
df1=pandas.read_csv('test01.csv')
df1

   ID     Name   LastName Title       Job  PhoneNumber
0   1     Jack      Jacky    Mr  Engineer   9112345676
1   2    Helga    Schmith   Mrs     Nurse    987654321
2   3    Javad     Yasari    Mr    Singer  98765431123
3   4  Sakineh     Yavari    Ms  HomeDoer    987656765
4   5   Hosein  Ibnilarab    Mr      Arab  96253635472

In [18]:
df2=pandas.read_csv("test01.txt",sep=";")
df2

   ID     Name   LastName Title       Job  PhoneNumber
0   1     Jack      Jacky    Mr  Engineer   9112345676
1   2    Helga    Schmith   Mrs     Nurse    987654321
2   3    Javad     Yasari    Mr    Singer  98765431123
3   4  Sakineh     Yavari    Ms  HomeDoer    987656765
4   5   Hosein  Ibnilarab    Mr      Arab  96253635472

In [20]:
df3=pandas.read_csv('SortModule.txt',sep=",",heade='none')
df3

NameError: name 'none' is not defined